app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("reminder_of_appointment", "reason_for_visit", "date_of_visit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["reminder_of_appointment", ""], ["reason_for_visit", ""], ["date_of_visit", "2015-10-23"], ["created_at", "2015-10-23 03:28:58.153489"], ["updated_at", "2015-10-23 03:28:58.153489"]]
---
  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save