app/controllers/pets_controller.rb

INSERT INTO "pets" ("pet_name", "type_of_pet", "breed", "date_of_visit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["pet_name", ""], ["type_of_pet", ""], ["breed", ""], ["date_of_visit", "2015-10-23"], ["created_at", "2015-10-23 03:29:38.079950"], ["updated_at", "2015-10-23 03:29:38.079950"]]
---
  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save